app/controllers/posts_controller.rb

SELECT  "authors".* FROM "authors" ORDER BY "authors"."id" ASC LIMIT ?  [["LIMIT", 1]]
INSERT INTO "posts" ("title", "description", "created_at", "updated_at", "author_id") VALUES (?, ?, ?, ?, ?)  [["title", "My post title"], ["description", "My post description"], ["created_at", "2020-02-28 03:58:18.993485"], ["updated_at", "2020-02-28 03:58:18.993485"], ["author_id", 1]]
---
  def create
    @author = Author.first
    @post = Post.new
    @post.title = params[:title]
    @post.description = params[:description]
    @post.author_id = @author.id
    @post.save